akshanshjha31-gif/bcm-simulator/firmware/core/stm32f1xx_hal_conf.h
/**
 * @file    stm32f1xx_hal_conf.h
 * @brief   HAL configuration for the BCM Simulator (STM32F103C8T6).
 *
 * Hand-maintained (as CubeMX would generate). Only the peripheral modules the
 * BCM actually uses are enabled, keeping code size down on the 64K part.
 */
#ifndef STM32F1xx_HAL_CONF_H
#define STM32F1xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* ######## Module selection ############################################### */
#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_IWDG_MODULE_ENABLED

/* ######## Oscillator values (Blue Pill: 8 MHz HSE crystal) ############### */
#if !defined(HSE_VALUE)
#define HSE_VALUE            8000000U
#endif
#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT  100U
#endif
#if !defined(HSI_VALUE)
#define HSI_VALUE            8000000U
#endif
#if !defined(LSI_VALUE)
#define LSI_VALUE            40000U
#endif
#if !defined(LSE_VALUE)
#define LSE_VALUE            32768U
#endif
#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT  5000U
#endif

/* ######## System configuration ########################################## */
#define VDD_VALUE            3300U
#define TICK_INT_PRIORITY    0x0FU
#define USE_RTOS             0U
#define PREFETCH_ENABLE      1U

#define USE_HAL_ADC_REGISTER_CALLBACKS   0U
#define USE_HAL_UART_REGISTER_CALLBACKS  0U

/* ######## Assert selection ############################################### */
/* #define USE_FULL_ASSERT   1U */

/* ######## Module includes ############################################### */
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32f1xx_hal_rcc.h"
#endif
#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32f1xx_hal_gpio.h"
#endif
#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32f1xx_hal_exti.h"
#endif
/* ADC must follow DMA: stm32f1xx_hal_adc.h refers to DMA_HandleTypeDef. */
#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32f1xx_hal_dma.h"
#endif
#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32f1xx_hal_adc.h"
#endif
#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32f1xx_hal_cortex.h"
#endif
#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32f1xx_hal_flash.h"
#endif
#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32f1xx_hal_pwr.h"
#endif
#ifdef HAL_UART_MODULE_ENABLED
#include "stm32f1xx_hal_uart.h"
#endif
#ifdef HAL_IWDG_MODULE_ENABLED
#include "stm32f1xx_hal_iwdg.h"
#endif

/* ######## Assert macro ################################################## */
#ifdef USE_FULL_ASSERT
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* STM32F1xx_HAL_CONF_H */
